// ✅ do...while чист?

// do...while ҳамон while аст, фақат як фарқ дорад:

// Аввал код иҷро мешавад

// Баъд шарт санҷида мешавад

// Яъне, ҳатто агар шарт нодуруст бошад ҳам, як бор код иҷро мешавад
// do {
//   // код
// } while (шарт);

// ++
// let i = 0;
// do {
//   console.log(i);
//   i++;
// } while (i <= 10);

// --
// let i = 10;
// do {
//   console.log(i);
//   i--;
// } while (i >= 0);

// *
// let i = 1;
// do {
//   console.log(i);
//   i *= 10;
// } while (i <= 10000);
