// ✅ for чист?
// for як даврзанӣ (такроркунӣ) аст. Вақте ки мо мехоҳем
// як амалиётро якчанд бор такрор кунем, for истифода мекунем.

// | Қисм    | Манош                |
// | ------- | -------------------- |
// | `for`   | такрор кардан        |
// | `i = 0` | оғоз аз 0            |
// | `i < 5` | то кай такрор шавад  |
// | `i++`   | ҳар дафъа зиёд шавад |

// | Хусусият       | `for...in`          | `for...of`              |
// | -------------- | ------------------- | ----------------------- |
// | Барои          | Object, Array       | Array, String, Iterable |
// | Чиро мегирад?  | КАЛИД (key, индекс) | Арзиш (value)           |
// | Кор мекунад бо | `{}` ва `[]`        | Танҳо бо `[]`, `"abc"`  |

// ++
// for (let i = 0; i <= 10; i++) {
//   console.log(i);
// }

// --
// for (let i = 10; i >= 0; i++) {
//   console.log(i);
// }

// *
// for (let i = 1; i <= 10000; i *= 10) {
//   console.log(i);
// }

